app/controllers/attendances_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
UPDATE "attendances" SET "finished_at" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["finished_at", "2021-07-30 18:42:00"], ["updated_at", "2021-07-30 18:42:50.712685"], ["id", 31]]
---
  def update
   @user = User.find(params[:user_id])
   @attendance = Attendance.find(params[:id])
   if @attendance.started_at.nil?
     if @attendance.update_attributes(started_at: Time.current.change(sec: 0))

SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "attendances" SET "started_at" = ?, "note" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["started_at", "2021-07-30 16:23:00"], ["note", ""], ["updated_at", "2021-07-31 05:37:12.854093"], ["id", 31]]
---
  def update_one_month
    ActiveRecord::Base.transaction do
        attendances_params.each do |id, item|
         attendance = Attendance.find(id)
         attendance.update_attributes!(item)